sanhab-templates/registerCarLostDocument-soapTemplate.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:ns="http://schemas.datacontract.org/2004/07/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:RegWbsCarDocLos>
         <!--Optional:-->
         <tem:carDocLosReq>
            <!--Optional:-->
            <ns:AcdRsnCod>${AcdRsnCod}</ns:AcdRsnCod>
            <!--Optional:-->
            <ns:AcdTypCod>${AcdTypCod}</ns:AcdTypCod>
            <!--Optional:-->
            <ns:AgncFldCod>${AgncFldCod}</ns:AgncFldCod>
            <!--Optional:-->
            <ns:AncDte>${AncDte}</ns:AncDte>
            <!--Optional:-->
            <ns:BrnhFldCod>${BrnhFldCod}</ns:BrnhFldCod>
            <!--Optional:-->
            <ns:CarDocDte>${CarDocDte}</ns:CarDocDte>
            <!--Optional:-->
            <ns:CmpltDte>${CmpltDte}</ns:CmpltDte>
            <!--Optional:-->
            <ns:CrkGuid>${CrkGuid:-}</ns:CrkGuid>
            <!--Optional:-->
            <ns:CrkSeri>${CrkSeri:-}</ns:CrkSeri>
            <!--Optional:-->
            <ns:CrkSrl>${CrkSrl}</ns:CrkSrl>
            <!--Optional:-->
            <ns:CtyId>${CtyId}</ns:CtyId>
            <!--Optional:-->
            <ns:CusAccFthNam>${CusAccFthNam}</ns:CusAccFthNam>
            <!--Optional:-->
            <ns:CusAccIdNum>${CusAccIdNum}</ns:CusAccIdNum>
            <!--Optional:-->
            <ns:CusAccInsTypCod>${CusAccInsTypCod}</ns:CusAccInsTypCod>
            <!--Optional:-->
            <ns:CusAccIsIrn>${CusAccIsIrn}</ns:CusAccIsIrn>
            <!--Optional:-->
            <ns:CusAccLNam>${CusAccLNam}</ns:CusAccLNam>
            <!--Optional:-->
            <ns:CusAccLglId>${CusAccLglId:-}</ns:CusAccLglId>
            <!--Optional:-->
            <ns:CusAccLglNam>${CusAccLglNam:-}</ns:CusAccLglNam>
            <!--Optional:-->
            <ns:CusAccLicTypCod>${CusAccLicTypCod}</ns:CusAccLicTypCod>
            <!--Optional:-->
            <ns:CusAccNam>${CusAccNam}</ns:CusAccNam>
            <!--Optional:-->
            <ns:CusAccNtnId>${CusAccNtnId}</ns:CusAccNtnId>
            <!--Optional:-->
            <ns:CusAccUnIrnCod>${CusAccUnIrnCod:-}</ns:CusAccUnIrnCod>
            <!--Optional:-->
            <ns:CusBrthDte>${CusBrthDte}</ns:CusBrthDte>
            <!--Optional:-->
            <ns:CusCertDte>${CusCertDte:-}</ns:CusCertDte>
            <!--Optional:-->
            <ns:CusCertGuid>${CusCertGuid:-}</ns:CusCertGuid>
            <!--Optional:-->
            <ns:CusCertNum>${CusCertNum}</ns:CusCertNum>
            <!--Optional:-->
            <ns:CusHasLic>${CusHasLic}</ns:CusHasLic>
            <!--Optional:-->
            <ns:CusIsMrd>${CusIsMrd}</ns:CusIsMrd>
            <!--Optional:-->
            <ns:CusJobAdrs>${CusJobAdrs}</ns:CusJobAdrs>
            <!--Optional:-->
            <ns:CusJobNam>${CusJobNam}</ns:CusJobNam>
            <!--Optional:-->
            <ns:CusMaleCod>${CusMalecod}</ns:CusMaleCod>
            <!--Optional:-->
            <ns:DrvLcnsDte>${DrvLcnsDte}</ns:DrvLcnsDte>
            <!--Optional:-->
            <ns:EdrsWbsCarPlcyUnqCod>${EdrsWbsCarPlcyUnqCod}</ns:EdrsWbsCarPlcyUnqCod>
            <!--Optional:-->
            <ns:FleDte>${FleDte}</ns:FleDte>
            <!--Optional:-->
            <ns:InCty>${InCty}</ns:InCty>
            <!--Optional:-->
            <ns:IsLcnsFit>${IsLcnsFit}</ns:IsLcnsFit>
            <!--Optional:-->
            <ns:LglDocDte>${LglDocDte}</ns:LglDocDte>
            <!--Optional:-->
            <ns:LosEvl>${LosEvl}</ns:LosEvl>
            <!--Optional:-->
            <ns:LosEvlLglId>${LosEvlLglId:-}</ns:LosEvlLglId>
            <!--Optional:-->
            <ns:LosEvlNtnlId>${LosEvlNtnlId}</ns:LosEvlNtnlId>
            <!--Optional:-->
            <ns:LstRprtDte>${LstRprtDte}</ns:LstRprtDte>
            <!--Optional:-->
            <ns:MapAcdRsn>${MapAcdRsn}</ns:MapAcdRsn>
            <!--Optional:-->
            <ns:MapAcdRsnCod>${MapAcdRsnCod}</ns:MapAcdRsnCod>
            <!--Optional:-->
            <ns:MapCtyCod>${Mapctycode}</ns:MapCtyCod>
            <!--Optional:-->
            <ns:MapCtyNam>${Mapctynam}</ns:MapCtyNam>
            <!--Optional:-->
            <ns:NjRptDte>${LstNjRptDte}</ns:NjRptDte>
            <!--Optional:-->
            <ns:OcrAdr>${OcrAdr}</ns:OcrAdr>
            <!--Optional:-->
            <ns:OcrDte>${OcrDte}</ns:OcrDte>
            <!--Optional:-->
            <ns:PlcyDte>${PlcyDte}</ns:PlcyDte>
            <!--Optional:-->
            <ns:PlcyWbsCarPlcyUnqCod>${PlcyWbsCarPlcyUnqCod}</ns:PlcyWbsCarPlcyUnqCod>
            <!--Optional:-->
            <ns:PlkCod>${PlkCod}</ns:PlkCod>
            <!--Optional:-->
            <ns:PlkTypCod>${PlkTypCod}</ns:PlkTypCod>
            <!--Optional:-->
            <ns:PrntDocLosCmpDocNo></ns:PrntDocLosCmpDocNo>
            <!--Optional:-->
            <ns:PrntPlcyCmpDocNo>${PrntPlcyCmpDocNo}</ns:PrntPlcyCmpDocNo>
            <!--Optional:-->
            <ns:ThrDmgTypCod>${ThrDmgTypCod}</ns:ThrDmgTypCod>
            <!--Optional:-->
            <ns:VehCntryCod>${VehCntryCod}</ns:VehCntryCod>
            <!--Optional:-->
            <ns:plk>${Plk}</ns:plk>
            <!--Optional:-->
            <ns:plk1>${Plk1}</ns:plk1>
            <!--Optional:-->
            <ns:plk2>${Plk2}</ns:plk2>
            <!--Optional:-->
            <ns:plk3>${Plk3}</ns:plk3>
            <!--Optional:-->
            <ns:plkCty>${PlkCty}</ns:plkCty>
            <!--Optional:-->
            <ns:plkSrl>${PlkSrl}</ns:plkSrl>
            <!--Optional:-->
            <ns:version>${version}</ns:version>
         </tem:carDocLosReq>
         <!--Optional:-->
         <tem:Username>${Username}</tem:Username>
         <!--Optional:-->
         <tem:PassWrod>${PassWrod}</tem:PassWrod>
      </tem:RegWbsCarDocLos>
   </soapenv:Body>
</soapenv:Envelope>